/** @format */
const weatherDictionary = new Map([
  ["cloudy", "☁️"],
  ["storm", "​☁️​⚡​💦​"],
  ["rain", "​☁️​☔​"],
  ["windy_day", "​🌫​🌪​🌡​"],
  ["fog", "🌫"],
  ["smog", "🌫️"],
  ["snow_blanket", "​🌬​🌨​❄️​⛄​"],
  ["riddle", "🌧️​🌪️​🌫️"],
  ["tornado", "🌪"],
  ["01d", "🌞"],
  ["02d", "⛅"],
  ["03d", "☀️ ☁️ ☁️"],
  ["04d", "☁️☀️☁️"],
  ["01n", "🌑🌃"],
  ["02n", "⛅"],
  ["03n", "🌑 ☁️ ☁️"],
  ["04n", "☁️🌑☁️"],
  ["901", "☄️"], // comet / meteor
  ["900", "🌊"], // water wave
  ["802", "🌀"], // hurricane
  ["801", "☁️☀️☁️"],
  ["802", "☁️🌤️☁️"],
  ["803", "☁️⛅☁️"],
  ["804", "☁️🌥️☁️"],
  ["800", "🌞"],
  ["701", ""],
  ["711", ""],
  ["721", ""],
  ["731", ""],
  ["741", "🌫️"],
  ["751", ""],
  ["761", ""],
  ["762", "🌋"],
  ["771", "🌬️"],
  ["781", "🌪️"],
  ["600", "🌨️"],
  ["601", "🌨️🌨️"],
  ["602", "🌨️🌨️🌨️"],
  ["611", "🌨️🌧️"],
  ["612", "🌨️🌧️🌨️"],
  ["613", "🌨️🌨️🌧️🌨️🌨️"],
  ["615", "🌨️🌨️🌨️🌧️🌨️🌨️🌨️"],
  ["616", "🌨️🌧️"],
  ["620", "🌨️🌨️"],
  ["621", "🌨️🌨️🌨️"],
  ["622", "🌨️🌨️🌨️🌨️"],
  ["500", "🌦️"],
  ["501", "☔🌧️🌦️🌧️"],
  ["502", "☔🌧️🌧️🌦️🌧️🌧️"],
  ["503", "☔🌧️🌧️🌧️🌦️🌧️🌧️🌧️"],
  ["504", "☔🌧️🌧️🌧️🌧️🌧️🌧️"],
  ["511", "🌦️🌧️🌨️"],
  ["520", "🌦️"],
  ["521", "🌧️🌦️🌧️"],
  ["522", "🌧️🌧️🌦️🌧️🌧️"],
  ["531", "🌧️🌧️🌧️🌦️🌧️🌧️🌧️"],
  ["300", "☔🌧️"],
  ["301", "☔🌧️🌧️"],
  ["302", "☔🌧️🌧️🌧️"],
  ["310", "☔🌧️"],
  ["311", "☔🌧️🌧️"],
  ["312", "☔🌧️🌧️🌧️"],
  ["313", "☔🌧️"],
  ["314", "☔🌧️🌧️"],
  ["321", "☔🌧️🌧️🌧️"],
  ["200", "⛈🌩️🌩️🌧️"],
  ["201", "⛈🌩️🌩️🌧️🌧️"],
  ["202", "🌩️🌩️🌧️🌧️🌧️"],
  ["210", "🌩️"],
  ["211", "🌩️🌩️"],
  ["212", "🌩️🌩️🌩️"],
  ["221", "🌩️🌩️🌩️🌩️"],
  ["230", "⛈⛈⛈🌩️🌩️🌧️"],
  ["231", "🌩️🌩️🌧️🌧️"],
  ["232", "🌩️🌩️🌧️🌧️🌧️"],
]);

const WeatherWidget = () => (
  <div>
    <p alt="night time scattered clouds " style={{ fontSize: "100px" }}>
      {weatherDictionary.get("803")}
      <i className="fas fa-cloud-moon"></i>
    </p>
    <p alt="night time scattered clouds " style={{ fontSize: "100px" }}>
      {weatherDictionary.get("803")}
      <i className="fas fa-cloud-moon"></i>
    </p>
    ;
  </div>
);
export default WeatherWidget;
